fix: mermaid
